app/controllers/notes_controller.rb

  def index
    @notes = Note.order(created_at: :desc)
---
SELECT "notes".* FROM "notes" ORDER BY "notes"."created_at" DESC

  def create
#    @note = Note.new(note_params)
@note = current_admin.notes.build(note_params)
    respond_to do |format|
      if @note.save
---
INSERT INTO "notes" ("note_id", "title", "text", "admin_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["note_id", nil], ["title", "HEllo"], ["text", " NNurr'fl4mf/e,dfm"], ["admin_id", 6], ["created_at", "2023-04-12 16:57:27.730390"], ["updated_at", "2023-04-12 16:57:27.730390"]]

  def correct_admin
    @note = current_admin.notes.find_by(id: params[:id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."admin_id" = ? AND "notes"."id" = ? LIMIT ?  [["admin_id", 8], ["id", 34], ["LIMIT", 1]]

  def update
    respond_to do |format|
      if @note.update(note_params)
---
UPDATE "notes" SET "text" = ?, "updated_at" = ? WHERE "notes"."id" = ?

    def set_note
     # @note = Note.find(params[:id])

    @note = current_admin.notes.find_by(id: params[:id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."admin_id" = ? AND "notes"."id" = ? LIMIT ?  [["admin_id", 6], ["id", 47], ["LIMIT", 1]]