app/controllers/users_controller.rb

INSERT INTO "users" ("user_id", "first_name", "last_name", "email", "phone", "username", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "last_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["last_name", "BIza"], ["updated_at", "2023-04-11 12:36:40.912468"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)